# tarea 2

In [5]:
import pandas as pd
import numpy as np

In [6]:
def ex1_concat_same_structure():
    """Ejercicio 1:
    Crea dos DataFrame que compartan la misma estructura de columnas (por ejemplo,
    'Nombre' y 'Edad'), con al menos 3 filas cada uno. Concaténalos verticalmente
    en un único DataFrame. Retorna el DataFrame resultante.
    """
    pass

In [11]:
data = [['Ana', '23'], ['Monce', '20'], ['Nat','19']]
df1 = pd.DataFrame(data, columns= ['Nombre','Edad'])
df1

  Nombre Edad
0    Ana   23
1  Monce   20
2    Nat   19

In [13]:
data2 = [['Mariana', '19'], ['Valentina', '22'], ['Melisa','23']]
df2 = pd.DataFrame(data2, columns= ['Nombre','Edad'])
df2

      Nombre Edad
0    Mariana   19
1  Valentina   22
2     Melisa   23

In [28]:
df_vertical = pd.concat([df1, df2], ignore_index=True)
df_vertical

      Nombre Edad
0        Ana   23
1      Monce   20
2        Nat   19
3    Mariana   19
4  Valentina   22
5     Melisa   23

In [ ]:
def ex2_concat_with_month_column():
    """Ejercicio 2:
    Tienes un DataFrame con ventas de enero y otro con ventas de febrero (mismas columnas).
    Concaténalos en un solo DataFrame y añade una columna que indique el mes original
    de cada fila (por ejemplo: 'Enero' o 'Febrero'). Retorna el DataFrame resultante.
    """
    pass

In [21]:
data = np.round(np.random.uniform(5000, 20000, 10), 2)
ventas_enero = pd.DataFrame({'Día':range (1,11), 'Venta': data})
ventas_enero

   Día     Venta
0    1  19043.87
1    2   7527.83
2    3  12545.87
3    4  12281.40
4    5   6116.09
5    6  18745.66
6    7   9052.37
7    8  10613.70
8    9  12265.24
9   10   6195.73

In [22]:
data = np.round(np.random.uniform(5000, 20000, 10), 2)
ventas_feb = pd.DataFrame({'Día':range (1,11), 'Venta': data})
ventas_feb

   Día     Venta
0    1  15856.80
1    2  12013.78
2    3  18720.66
3    4  12070.73
4    5   9215.46
5    6   5773.00
6    7  19682.88
7    8   8390.61
8    9  17731.09
9   10   7037.99

In [27]:
ventas = pd.concat([ventas_enero, ventas_feb], ignore_index=True)
ventas['Mes'] = ['Enero']*10 + ['Febrero']*10
ventas

    Día     Venta      Mes
0     1  19043.87    Enero
1     2   7527.83    Enero
2     3  12545.87    Enero
3     4  12281.40    Enero
4     5   6116.09    Enero
5     6  18745.66    Enero
6     7   9052.37    Enero
7     8  10613.70    Enero
8     9  12265.24    Enero
9    10   6195.73    Enero
10    1  15856.80  Febrero
11    2  12013.78  Febrero
12    3  18720.66  Febrero
13    4  12070.73  Febrero
14    5   9215.46  Febrero
15    6   5773.00  Febrero
16    7  19682.88  Febrero
17    8   8390.61  Febrero
18    9  17731.09  Febrero
19   10   7037.99  Febrero

In [ ]:
def ex3_concat_diff_columns_fillna():
    """Ejercicio 3:
    Crea dos DataFrame que no tengan exactamente las mismas columnas (ej.: uno tiene
    'Producto' y 'Ventas', el otro 'Producto' y 'Descuento'). Concaténalos y asegura
    que los valores faltantes queden rellenados con 0. Retorna el DataFrame resultante.
    """
    pass

In [32]:
data = np.random.randint(0, 30, 5)
ventas = pd.DataFrame({'Producto': ['cafe', 'pan', 'chocolate', 'te', 'pastel'] , 'Ventas': data})
ventas

    Producto  Ventas
0       cafe      12
1        pan      24
2  chocolate      17
3         te      15
4     pastel       7

In [33]:
descuento = pd.DataFrame({'Producto': ['cafe', 'pan', 'chocolate', 'te', 'pastel'] , 'Descuento': [10, 25, 10, 15, 25]})
descuento

    Producto  Descuento
0       cafe         10
1        pan         25
2  chocolate         10
3         te         15
4     pastel         25

In [35]:
ventascon = pd.concat([ventas, descuento], ignore_index=True)
ventascon

    Producto  Ventas  Descuento
0       cafe    12.0        NaN
1        pan    24.0        NaN
2  chocolate    17.0        NaN
3         te    15.0        NaN
4     pastel     7.0        NaN
5       cafe     NaN       10.0
6        pan     NaN       25.0
7  chocolate     NaN       10.0
8         te     NaN       15.0
9     pastel     NaN       25.0

In [36]:
ventascon.fillna(value='0')

    Producto Ventas Descuento
0       cafe   12.0         0
1        pan   24.0         0
2  chocolate   17.0         0
3         te   15.0         0
4     pastel    7.0         0
5       cafe      0      10.0
6        pan      0      25.0
7  chocolate      0      10.0
8         te      0      15.0
9     pastel      0      25.0

In [ ]:
def ex4_concat_three_groups():
    """Ejercicio 4:
    Genera tres DataFrame pequeños (cada uno con, por ejemplo, 3 filas) que representen
    notas de distintos grupos de alumnos. Concaténalos verticalmente en un solo DataFrame
    que contenga todas las notas. Retorna el DataFrame resultante.
    """
    pass

In [54]:
data = [['Ana', '9'], ['Monce', '9'], ['Xim','8.5']]
df1 = pd.DataFrame(data, columns= ['Nombre','Calificación'])
df1

  Nombre Calificación
0    Ana            9
1  Monce            9
2    Xim          8.5

In [41]:
data2 = [['Rodrigo', '9.8'], ['Javi', '9'], ['Roy','8.9']]
df2 = pd.DataFrame(data2, columns= ['Nombre','Calificación'])
df2

    Nombre Calificación
0  Rodrigo          9.8
1     Javi            9
2      Roy          8.9

In [42]:
data3 = [['Pao', '8'], ['Pau', '9'], ['Meche','9.1']]
df3 = pd.DataFrame(data3, columns= ['Nombre','Calificación'])
df3

  Nombre Calificación
0    Pao            8
1    Pau            9
2  Meche          9.1

In [55]:
calificaciones= pd.concat([df1, df2, df3], ignore_index=True)
calificaciones

    Nombre Calificación
0      Ana            9
1    Monce            9
2      Xim          8.5
3  Rodrigo          9.8
4     Javi            9
5      Roy          8.9
6      Pao            8
7      Pau            9
8    Meche          9.1

In [ ]:
def ex5_remove_duplicates_preserve_order(lst):
    """Ejercicio 5:
    Dada una lista de enteros (o strings) que puede contener duplicados, devuelve una
    nueva lista sin duplicados preservando el orden original. No uses directamente set()
    para eliminar duplicados (escribe la lógica que preserve el orden). Retorna la nueva 
    lista sin duplicados.
    """
    pass

In [49]:
lista = [8, 5, 3, 5, 1, 9, 8, 0]
lista

[8, 5, 3, 5, 1, 9, 8, 0]

In [53]:
resultado = []

for elem in lista:
        if elem not in resultado:
            resultado.append(elem)
resultado

[8, 5, 3, 1, 9, 0]

In [ ]:
def ex6_sort_tuples_by_second_element(tuples_list):
    """Ejercicio 6:
    Dada una lista de tuplas, por ejemplo [("a", 3), ("b", 1), ("c", 2)], ordénala
    por el segundo elemento de cada tupla y devuelve la lista ordenada. Usa una función
    anónima si lo deseas. Retorna la lista ordenada.
    """
    pass

In [57]:
tupla = [("a", 3), ("b", 1), ("c", 2)]
tupla

[('a', 3), ('b', 1), ('c', 2)]

In [ ]:
def ex7_first_n_multiples_of_7(n):
    """Ejercicio 7:
    Devuelve una lista con los primeros n múltiplos de 7 (por ejemplo, n=5 -> [7,14,21,28,35]).
    Retorna la lista generada.
    """
    pass

In [ ]:
def ex8_filter_palindromes(strings):
    """Ejercicio 8:
    Dada una lista de cadenas, devuelve sólo aquellas que son palíndromos (se leen igual
    al derecho y al revés). Retorna una lista con los palíndromos encontrados.
    """
    pass